brew 'bat'
brew 'btop'
brew 'curl'
brew 'eza'
brew 'git'
brew 'git-delta'
brew 'helm'
brew 'jq'
brew 'kubernetes-cli'
brew 'k9s'
brew 'stow'
brew 'tig'
brew 'tmux'
brew 'unzip'
brew 'vim'
brew 'vivid'
brew 'zoxide'
brew 'zsh'
