brew 'bat'
brew 'btop'
brew 'curl'
brew 'direnv'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-interactive-rebase-tool'
brew 'gnu-time'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'luarocks'
brew 'neovim'
brew 'ripgrep'
brew 'stow'
brew 'tig'
brew 'tlrc'
brew 'tmux'
brew 'tree-sitter-cli'
brew 'unzip'
brew 'vim'
brew 'vivid'
brew 'watch'
brew 'wget'
brew 'zoxide'
brew 'zsh'
