cask_args appdir: '/Applications', no_quarantine: true

tap 'Azure/kubelogin'
tap 'hashicorp/tap'
tap 'homebrew/bundle'

# ----------------------------------------------------------------------------------------------------------
brew 'awscli'
brew 'Azure/kubelogin/kubelogin'
brew 'bash'
brew 'bat'
brew 'btop'
brew 'colima'
brew 'curl'
brew 'docker'
brew 'docker-compose'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-interactive-rebase-tool'
brew 'go'
brew 'hashicorp/tap/terraform'
brew 'helm'
brew 'jq'
brew 'k6'
brew 'k9s'
brew 'kubernetes-cli'
brew 'mas'
brew 'mise'
brew 'neovim'
brew 'powerlevel10k'
brew 'tig'
brew 'tldr'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'zsh'

# ----------------------------------------------------------------------------------------------------------
cask 'another-redis-desktop-manager'
cask 'appcleaner'
cask 'arc'
cask 'brave-browser'
cask 'firefox'
cask 'flycut'
cask 'font-meslo-lg-nerd-font'
cask 'intellij-idea'
cask 'iterm2'
cask 'keybase'
cask 'microsoft-auto-update'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'postman'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tailscale'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'yubico-yubikey-manager'
cask 'zoom'


# ----------------------------------------------------------------------------------------------------------
mas 'Bitwarden', id: 1352778147
mas 'Velja', id: 1607635845
mas 'Yubico Authenticator', id: 1497506650

# ----------------------------------------------------------------------------------------------------------
vscode 'eamodio.gitlens'
vscode 'esbenp.prettier-vscode'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'golang.go'
vscode 'hashicorp.terraform'
vscode 'ibm.output-colorizer'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-vscode-remote.remote-containers'
vscode 'redhat.vscode-yaml'
vscode 'vscode-icons-team.vscode-icons'

# https://community.cloudflare.com/t/warp-and-warp-routing-me-through-europe-instead-of-india/533920
# Not using as it is drastically reducing internet speed and increasing ping
# Picking up server in frankfut instead of a server in India.
# Will reuse once the issue is resolved.
# cask 'cloudflare-warp'
